import { ISlideContent } from '../types/types';

export const slidesContent: ISlideContent[] = [
  {
    title: 'Литература',
    id: 1,
    facts: [
      {
        id: 2004,
        year: '2004',
        fact: 'Национальный бестселлер — Виктор Пелевин, «ДПП (NN)»',
      },
      {
        id: 2005,
        year: '2005',
        fact: 'Гарри Поттер и Принц-полукровка',
      },
      {
        id: 2006,
        year: '2006',
        fact: 'Всемирная премия фэнтези за лучший роман — Харуки Мураками, роман «Кафка на пляже»',
      },
      {
        id: 2007,
        year: '2007',
        fact: 'Пулитцеровская премия за художественную книгу — Кормак Маккарти, «Дорога»',
      },
      {
        id: 2008,
        year: '2008',
        fact: 'Голодные игры - роман Сьюзен Коллинз.',
      },
    ],
  },
  {
    title: 'Наука',
    id: 2,
    facts: [
      {
        id: 2009,
        year: '2009',
        fact: ' На медицинской пресс-конференции в Германии было объявлено о первой в мире успешной пересадке рук',
      },
      {
        id: 2010,
        year: '2010',
        fact: '«Роскосмос» запустил модернизированный цифровой «Союз ТМА-01М» с космодрома Байконур',
      },
      {
        id: 2011,
        year: '2011',
        fact: 'Измерена точная температура (3200 °C) самой горячей планеты (WASP-33 b), известной на данный момент',
      },
      {
        id: 2012,
        year: '2012',
        fact: 'Астрофизики обнаружили уникальную чёрную дыру',
      },
      {
        id: 2013,
        year: '2013',
        fact: 'Выложены в открытый доступ результаты исследования полного генома неандертальца',
      },
    ],
  },
  {
    title: 'Кино',
    id: 3,
    facts: [
      {
        id: 2014,
        year: '2014',
        fact: 'Стражи Галактики',
      },
      {
        id: 2015,
        year: '2015',
        fact: 'Премия «Ника» за лучший игровой фильм: «Трудно быть богом»',
      },
      {
        id: 2016,
        year: '2016',
        fact: 'Дэдпул',
      },
      {
        id: 2017,
        year: '2017',
        fact: 'Премия «Оскар» за лучший анимационный фильм: «Зверополис»',
      },
      {
        id: 2018,
        year: '2018',
        fact: 'Веном',
      },
    ],
  },
  {
    title: 'Спорт',
    id: 4,
    facts: [
      {
        id: 2019,
        year: '2019',
        fact: 'Чемпионат мира по хоккею среди молодёжных команд (Флаг Канады Ванкувер, Виктория; Канада)',
      },
      {
        id: 2020,
        year: '2020',
        fact: '22 августа состоялся бой между Флаг Великобритании Диллианом Уайтом и Флаг России Александром Поветкиным за титулы временного чемпиона мира по версии WBC',
      },
      {
        id: 2021,
        year: '2021',
        fact: 'Чемпионат мира по настольному теннису (Хьюстон, США)',
      },
      {
        id: 2022,
        year: '2022',
        fact: '15 сентября — бывшая первая ракетка мира по теннису швейцарец Роджер Федерер объявил о завершении карьеры.',
      },
      {
        id: 2023,
        year: '2023',
        fact: '28 апреля — 7 мая — чемпионат Европы по русским шашкам среди мужчин и среди женщин (Турция Аланья, Турция).',
      },
    ],
  },
];
